indexxue/esp32-s3/project/sdkconfig.defaults
# N16R8 + dual OTA (see flash_partition/partitions_16m_n16r8.md).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Custom partition table (dual slot: app_a=ota_0, app_b=ota_1). See doc/partition_switch_development_plan.md.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../flash_partition/partitions_16m_n16r8.csv"

# Auto-start SoftAP + HTTP after BoardInit (see components/web_ctrl/README.md).
CONFIG_WEB_CTRL_AUTO_START=y

# BoardInit + web_ctrl_start() run on app_main before other tasks; 3584 B was too tight.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
